create database test_center;

use test_center;

create table oppo_phones (
  id INT NOT NULL auto_increment,
  another_name VARCHAR(80) DEFAULT NULL,
  model VARCHAR(80) DEFAULT NULL,
  ver VARCHAR(80) NOT NULL,
  resolution VARCHAR(80) NOT NULL,
  cpu_name VARCHAR(100) NOT NULL,
  cpu_ghz VARCHAR(100) NOT NULL,
  primary key (id)
) engine = InnoDB AUTO_INCREMENT = 1;

INSERT INTO
  oppo_phones (
    another_name,
    model,
    ver,
    resolution,
    cpu_name,
    cpu_ghz
  )
VALUES
  (
    "OPPO R17",
    "PBEM00",
    "9",
    "1080x2340",
    "高通 骁龙670",
    "1.8"
  ),
  (
    "OPPO R15x",
    "PBCM10",
    "10",
    "1080x2340",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO R17",
    "PBEM00",
    "9",
    "1080x2340",
    "高通 骁龙670",
    "1.8"
  ),
  (
    "OPPO A3",
    "PADM00",
    "9",
    "1080x2280",
    "联发科 Helio P60",
    "2"
  ),
  (
    "OPPO R17",
    "PBEM00",
    "8.1.0",
    "1080x2340",
    "高通 骁龙670",
    "1.8"
  ),
  (
    "OPPO A3",
    "PADM00",
    "8.1.0",
    "1080x2280",
    "联发科 Helio P60",
    "2"
  ),
  (
    "R15",
    "PACT00",
    "8.1.0",
    "1080x2280",
    "联发科 Helio P60",
    "2"
  ),
  (
    "OPPO Reno",
    "PCAM00",
    "9",
    "1080x2340",
    "高通 骁龙710",
    "1.8"
  ),
  (
    "R15",
    "PACT00",
    "9",
    "1080x2280",
    "联发科 Helio P60",
    "2"
  ),
  (
    "OPPO A5",
    "PBAM00",
    "8.1.0",
    "720x1520",
    "高通 骁龙450",
    "1.9"
  ),
  (
    "OPPO R15x",
    "PBCM10",
    "9",
    "1080x2340",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO K1",
    "PBCM30",
    "10",
    "1080x2340",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO A5",
    "PBAM00",
    "8.1.0",
    "720x1520",
    "高通 骁龙450",
    "1.9"
  ),
  (
    "K7x",
    "PERM00",
    "10",
    "1080x2400",
    "联发科 天玑720\t",
    "2"
  ),
  (
    "OPPO FIND X2",
    "PDEM10",
    "10",
    "1440x3168",
    "高通骁龙865",
    "1.9"
  ),
  (
    "OPPO R11s",
    "OPPO R11s",
    "8.1.0",
    "1080x2160",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "A7x",
    "PBBT00",
    "9",
    "1080x2340",
    "联发科 P60\t",
    "1.989"
  ),
  (
    "OPPO R11s",
    "OPPO R11s",
    "8.1.0",
    "1080x2160",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "R15 梦镜版",
    "PAAM00",
    "8.1.0",
    "1080x2280",
    "联发科 Helio P60",
    "1.9"
  ),
  (
    "OPPO R15",
    "PACM00",
    "9",
    "1080x2280",
    "联发科 Helio P60",
    "2"
  ),
  (
    "OPPO FIND X2",
    "PDEM10",
    "10",
    "1440x3168",
    "高通骁龙865",
    "1.9"
  ),
  (
    "OPPO A59m",
    "OPPO A59m",
    "5.1",
    "720x1280",
    "联发科 MT6750 ",
    "1.6"
  ),
  (
    "Find X2 Pro",
    "PDEM30",
    "11",
    "1440x3168",
    "高通 骁龙865",
    "1.9"
  ),
  (
    "OPPO A5",
    "PBAM00",
    "8.1.0",
    "720x1520",
    "高通 骁龙450",
    "1.9"
  ),
  (
    "OPPO R11s Plus",
    "OPPO R11s Plus",
    "8.1.0",
    "1080x2160",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "R11 Plusk",
    "OPPO R11 Plusk",
    "8.1.0",
    "1080x1920",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO R11s Plus",
    "OPPO R11s Plus",
    "9",
    "1080x2160",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO Reno4 Pro",
    "PDNM00",
    "10",
    "1080x2400",
    "高通 骁龙765G",
    "1.9"
  ),
  (
    "A77",
    "OPPO A77",
    "7.1.1",
    "1080x1920",
    "高通 骁龙625",
    "2.016"
  ),
  (
    "OPPO K3",
    "PCGM00",
    "9",
    "1080x2340",
    "高通 骁龙710",
    "1.8"
  ),
  (
    "OPPO Ace2",
    "PDHM00",
    "10",
    "1080x2400",
    "高通 骁龙865\t",
    "1.9"
  ),
  (
    "OPPO Find X",
    "PAFM00",
    "9",
    "1080x2340",
    "高通 骁龙845",
    "1.8"
  ),
  (
    "OPPO A59m",
    "OPPO A59m",
    "5.1",
    "720x1280",
    "联发科 MT6750 ",
    "1.6"
  ),
  (
    "R9 Plustm A",
    "OPPO R9 Plustm A",
    "5.1.1",
    "1080x1920",
    "高通 骁龙652",
    "1.5"
  ),
  (
    "OPPO Find X",
    "PAFM00",
    "9",
    "1080x2340",
    "高通 骁龙845",
    "1.8"
  ),
  (
    "oppo Reno4 5G",
    "PDPM00",
    "11",
    "1080x2400",
    "高通 骁龙765G",
    "1.9"
  ),
  (
    "R9 Plustm A",
    "OPPO R9 Plustm A",
    "5.1.1",
    "1080x1920",
    "高通 骁龙652",
    "1.5"
  ),
  (
    "OPPO A83",
    "OPPO A83",
    "7.1.1",
    "720x1440",
    "联发科 MT6763T",
    "1.8"
  ),
  (
    "OPPO A3",
    "PADM00",
    "9",
    "1080x2280",
    "联发科 Helio P60",
    "2"
  ),
  (
    "OPPO R9s Plus",
    "OPPO R9s Plus",
    "6.0.1",
    "1080x1920",
    "高通 骁龙653Pro",
    "1.5"
  ),
  (
    "A77",
    "OPPO A77",
    "7.1.1",
    "1080x1920",
    "高通 骁龙625",
    "2.016"
  ),
  (
    "OPPO R17",
    "PBEM00",
    "10",
    "1080x2340",
    "高通 骁龙670",
    "1.8"
  ),
  (
    "OPPO A59s",
    "OPPO A59s",
    "5.1",
    "720x1280",
    "联发科 MT6750",
    "1.6"
  ),
  (
    "R11 Plus kt",
    "OPPO R11 Pluskt",
    "8.1.0",
    "1080x1920",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO A83",
    "OPPO A83",
    "7.1.1",
    "720x1440",
    "联发科 MT6763T",
    "1.8"
  ),
  (
    "OPPO R9s Plus",
    "OPPO R9s Plus",
    "6.0.1",
    "1080x1920",
    "高通 骁龙653Pro",
    "1.5"
  ),
  (
    "R9 Plustm A",
    "OPPO R9 Plustm A",
    "5.1.1",
    "1080x1920",
    "高通 骁龙652",
    "1.5"
  ),
  (
    "A77",
    "OPPO A77",
    "7.1.1",
    "1080x1920",
    "高通 骁龙625",
    "2.016"
  ),
  (
    "OPPO A9",
    "PCAM10",
    "9",
    "1080x2340",
    "联发科 Helio P70V",
    "2"
  ),
  (
    "OPPO A3",
    "PADM00",
    "9",
    "1080x2280",
    "联发科 Helio P60",
    "2"
  ),
  (
    "OPPO Reno3元气版",
    "PCLM50",
    "10",
    "1080x2400",
    "高通 骁龙765",
    "1.9"
  ),
  (
    "oppo Reno4 5G",
    "PDPM00",
    "11",
    "1080x2400",
    "高通 骁龙765G",
    "1.9"
  ),
  (
    "OPPO Reno3",
    "PDCM00",
    "11",
    "1080x2400",
    "联发科 天玑1000L",
    "2"
  ),
  (
    "OPPO K5",
    "PCNM00",
    "9",
    "1080x2340",
    "高通 骁龙730G",
    "1.9"
  ),
  (
    "oppo Reno4 5G",
    "PDPM00",
    "10",
    "1080x2400",
    "高通 骁龙765G",
    "1.9"
  ),
  (
    "OPPO A9",
    "PCAM10",
    "9",
    "1080x2340",
    "联发科 Helio P70V",
    "2"
  ),
  (
    "OPPO R17",
    "PBEM00",
    "10",
    "1080x2340",
    "高通 骁龙670",
    "1.8"
  ),
  (
    "OPPO A83",
    "OPPO A83",
    "7.1.1",
    "720x1440",
    "联发科 MT6763T",
    "1.8"
  ),
  (
    "A83T",
    "OPPO A83t",
    "7.1.1",
    "720x1440",
    "联发科 MT6763T",
    "1.8"
  ),
  (
    "OPPO A9",
    "PCAM10",
    "9",
    "1080x2340",
    "联发科 Helio P70V",
    "2"
  ),
  (
    "OPPO A11x",
    "PCHM30",
    "9",
    "720x1600",
    "高通 骁龙665",
    "1.9"
  ),
  (
    "OPPO A9",
    "PCAM10",
    "9",
    "1080x2340",
    "联发科 Helio P70V",
    "2"
  ),
  (
    "OPPO FIND X2",
    "PDEM10",
    "10",
    "1440x3168",
    "高通骁龙865",
    "1.9"
  ),
  (
    "OPPO K5",
    "PCNM00",
    "10",
    "1080x2340",
    "高通 骁龙730G",
    "1.9"
  ),
  (
    "R15 梦镜版",
    "PAAM00",
    "10",
    "1080x2280",
    "联发科 Helio P60",
    "1.9"
  ),
  (
    "OPPO R11s",
    "OPPO R11s",
    "9",
    "1080x2160",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "A37f",
    "A37f",
    "5.1.1",
    "720x1280",
    " 高通骁龙 410",
    "1.2096"
  ),
  (
    "OPPO A7",
    "PBFM00",
    "8.1.0",
    "720x1520",
    "高通 骁龙450",
    "1.9"
  ),
  (
    "OPPO R15x",
    "PBCM10",
    "9",
    "1080x2340",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "A37m",
    "OPPO A37m",
    "5.1",
    "720x1280",
    "联发科 MT6750",
    "1.508"
  ),
  (
    "A37m",
    "OPPO A37m",
    "5.1",
    "720x1280",
    "联发科 MT6750",
    "1.508"
  ),
  (
    "OPPO Reno Z",
    "PCDM10",
    "10",
    "1080x2340",
    "联发科 Helio P90",
    "2"
  ),
  (
    "OPPO K3",
    "PCGM00",
    "10",
    "1080x2340",
    "高通 骁龙710",
    "1.8"
  ),
  (
    "OPPO A91",
    "PCPM00",
    "10",
    "1080x2400",
    "联发科 Helio P70V",
    "2"
  ),
  (
    "OPPO K1",
    "PBCM30",
    "9",
    "1080x2340",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO R11s",
    "OPPO R11s",
    "8.1.0",
    "1080x2160",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO Reno Z",
    "PCDM10",
    "10",
    "1080x2340",
    "联发科 Helio P90",
    "2"
  ),
  (
    "oppo A72",
    "PDYM20",
    "10",
    "1080x2400",
    "联发科 天玑720",
    "2"
  ),
  (
    "OPPO A3",
    "PADM00",
    "9",
    "1080x2280",
    "联发科 Helio P60",
    "2"
  ),
  (
    "OPPO A11x",
    "PCHM30",
    "9",
    "720x1600",
    "高通 骁龙665",
    "1.9"
  ),
  (
    "R15 梦镜版",
    "PAAM00",
    "10",
    "1080x2280",
    "联发科 Helio P60",
    "1.9"
  ),
  (
    "OPPO R15x",
    "PBCM10",
    "10",
    "1080x2340",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO R17",
    "PBEM00",
    "8.1.0",
    "1080x2340",
    "高通 骁龙670",
    "1.8"
  ),
  (
    "OPPO R15x",
    "PBCM10",
    "9",
    "1080x2340",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO A11",
    "PCHM10",
    "9",
    "720x1600",
    "高通 骁龙665",
    "1.9"
  ),
  (
    "R15 梦镜版",
    "PAAM00",
    "8.1.0",
    "1080x2280",
    "联发科 Helio P60",
    "1.9"
  ),
  (
    "OPPO Reno",
    "PCAM00",
    "10",
    "1080x2340",
    "高通 骁龙710",
    "1.8"
  ),
  (
    "OPPO Reno",
    "PCAM00",
    "10",
    "1080x2340",
    "高通 骁龙710",
    "1.8"
  ),
  (
    "R15 梦镜版",
    "PAAM00",
    "10",
    "1080x2280",
    "联发科 Helio P60",
    "1.9"
  ),
  (
    "OPPO Reno",
    "PCAM00",
    "10",
    "1080x2340",
    "高通 骁龙710",
    "1.8"
  ),
  (
    "OPPO A3",
    "PADM00",
    "10",
    "1080x2280",
    "联发科 Helio P60",
    "2"
  ),
  (
    "OPPO Reno Ace",
    "PCLM10",
    "9",
    "1080x2400",
    "高通 骁龙855PLUS",
    "1.8"
  ),
  (
    "OPPO Ace2",
    "PDHM00",
    "10",
    "1080x2400",
    "高通 骁龙865\t",
    "1.9"
  ),
  (
    "OPPO Reno Ace",
    "PCLM10",
    "10",
    "1080x2400",
    "高通 骁龙855PLUS",
    "1.8"
  ),
  (
    "OPPO Reno",
    "PCAT00",
    "10",
    "1080x2340",
    "高通 骁龙710",
    "1.8"
  ),
  (
    "R15梦境版",
    "PAAT00",
    "9",
    "1080x2280",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "A5",
    "PBBT30",
    "8.1.0",
    "720x1520",
    "高通 骁龙450B",
    "1.9"
  ),
  (
    "OPPO R17",
    "PBEM00",
    "10",
    "1080x2340",
    "高通 骁龙670",
    "1.8"
  ),
  (
    "OPPO A5",
    "PBAM00",
    "8.1.0",
    "720x1520",
    "高通 骁龙450",
    "1.9"
  ),
  (
    "OPPO A73t",
    "OPPO A73t",
    "7.1.1",
    "1080x2160",
    "联发科 MT6763T",
    "1.8"
  ),
  (
    "A5",
    "PBAT00",
    "8.1.0",
    "720x1520",
    "高通 骁龙450",
    "1.9"
  ),
  (
    "A83T",
    "OPPO A83t",
    "7.1.1",
    "720x1440",
    "联发科 MT6763T",
    "1.8"
  ),
  (
    "OPPO R9sk",
    "OPPO R9sk",
    "6.0.1",
    "1080x1920",
    "高通 骁龙625",
    "2.016"
  ),
  (
    "OPPO R11t",
    "OPPO R11t",
    "8.1.0",
    "1080x1920",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO A73",
    "OPPO A73",
    "7.1.1",
    "1080x2160",
    "联发科 MT6763T ",
    "1.8"
  ),
  (
    "OPPO R11s Plus",
    "OPPO R11s Plus",
    "8.1.0",
    "1080x2160",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "A5",
    "PBAT00",
    "8.1.0",
    "720x1520",
    "高通 骁龙450",
    "1.9"
  ),
  (
    "OPPO A92s",
    "PDKM00",
    "10",
    "1080x2400",
    "联发科 天玑800",
    "2"
  ),
  (
    "OPPO R11t",
    "OPPO R11t",
    "8.1.0",
    "1080x1920",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "A37m",
    "OPPO A37m",
    "5.1",
    "720x1280",
    "联发科 MT6750",
    "1.508"
  ),
  (
    "OPPO R11",
    "OPPO R11",
    "8.1.0",
    "1080x1920",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "R11 Plus",
    "OPPO R11 Plus",
    "8.1.0",
    "1080x1920",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "oppo r7 plusm",
    "R7Plusm",
    "5.1.1",
    "1080x1920",
    "高通 骁龙615",
    "1.4976"
  ),
  (
    "OPPO R15",
    "PACM00",
    "10",
    "1080x2280",
    "联发科 Helio P60",
    "2"
  ),
  (
    "OPPO A11x",
    "PCHM30",
    "10",
    "720x1600",
    "高通 骁龙665",
    "1.9"
  ),
  (
    "OPPO A9x",
    "PCEM00",
    "10",
    "1080x2340",
    "联发科 Helio P70V",
    "2"
  ),
  (
    "OPPO K1",
    "PBCM30",
    "10",
    "1080x2340",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO A7x",
    "PBBM00",
    "9",
    "1080x2340",
    "联发科 Helio P60",
    "2"
  ),
  (
    "OPPO A9x",
    "PCEM00",
    "10",
    "1080x2340",
    "联发科 Helio P70V",
    "2"
  ),
  (
    "OPPO A3",
    "PADM00",
    "9",
    "1080x2280",
    "联发科 Helio P60",
    "2"
  ),
  (
    "OPPO A52",
    "PDAM10",
    "10",
    "1080x2400",
    "高通 骁龙665\t",
    "1.9"
  ),
  (
    "OPPO K3",
    "PCGM00",
    "9",
    "1080x2340",
    "高通 骁龙710",
    "1.8"
  ),
  (
    "OPPO R15x",
    "PBCM10",
    "10",
    "1080x2340",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO A91",
    "PCPM00",
    "9",
    "1080x2400",
    "联发科 Helio P70V",
    "2"
  ),
  (
    "OPPO A11x",
    "PCHM30",
    "10",
    "720x1600",
    "高通 骁龙665",
    "1.9"
  ),
  (
    "A7x",
    "PBBT00",
    "9",
    "1080x2340",
    "联发科 P60\t",
    "1.989"
  ),
  (
    "A7x",
    "PBBT00",
    "9",
    "1080x2340",
    "联发科 P60\t",
    "1.989"
  ),
  (
    "R15梦境版",
    "PAAT00",
    "9",
    "1080x2280",
    "高通 骁龙660",
    "1.9"
  ),
  (
    "OPPO A92s",
    "PDKM00",
    "10",
    "1080x2400",
    "联发科 天玑800",
    "2"
  ),
  (
    "OPPO A3",
    "PADM00",
    "10",
    "1080x2280",
    "联发科 Helio P60",
    "2"
  ),
  (
    "OPPO Reno3元气版",
    "PCLM50",
    "10",
    "1080x2400",
    "高通 骁龙765",
    "1.9"
  ),
  (
    "OPPO A11",
    "PCHM10",
    "10",
    "720x1600",
    "高通 骁龙665",
    "1.9"
  ),
  (
    "OPPO Reno",
    "PCAM00",
    "10",
    "1080x2340",
    "高通 骁龙710",
    "1.8"
  ),
  (
    "OPPO A57T",
    "OPPO A57t",
    "6.0.1",
    "720x1280",
    "高通 骁龙435",
    "1.5"
  ),
  (
    "OPPO Find X",
    "PAFM00",
    "10",
    "1080x2340",
    "高通 骁龙845",
    "1.8"
  ),
  (
    "OPPO Find X",
    "PAFM00",
    "10",
    "1080x2340",
    "高通 骁龙845",
    "1.8"
  ),
  (
    "A9 移动4G+",
    "PCAT10",
    "10",
    "1080x2340",
    "联发科 Helio P70",
    "2"
  );